# Pandas

In [2]:
# pandas import
import pandas as pd

## series

1개의 컬럼 값으로 구성된 1차원 데이터 셋

In [4]:
data = ["A", "B", "C", "D"]
se = pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [5]:
# 가져온 데이터의 갯수 파악 
se.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
se.values

array(['A', 'B', 'C', 'D'], dtype=object)

In [8]:
# 인덱싱
print(se[1])
print(se[3])

B
D

In [10]:
# 슬라이싱
print(se[-1:])
print(se[:])

3    D
dtype: object
0    A
1    B
2    C
3    D
dtype: object

In [11]:
# 컬럼 이름 변경
se.name = "alphabet"
se

0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [12]:
# 인덱스 이름 변경
se.index.name ="NO."
se

NO.
0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [24]:
# Series 생성시 index 지정하기
data = [1, 2, 3, 4]

se = pd.Series(data, index=[1,2,3,5])
print(se)
print(se[1])

1    1
2    2
3    3
5    4
dtype: int64
1

In [25]:
# 조건 주기
se > 40

1    False
2    False
3    False
5    False
dtype: bool

# DataFrame

여러 개의 시리즈가 모여있는 것

In [29]:
import numpy as np

data = np.array([[1,2,3], [4,5,6], [7,8,9]])
column = ['D','E','F']

df = pd.DataFrame(data=data, index=['A', 'B', 'C'], columns = column)

df

# df = pd.read_csv("data.csv")

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [33]:
# DataFrame 생성
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C","D"]
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [34]:
# df.set_index로 인덱스 지정 - like 필터
df = df.set_index('grade')
df

      country  rank
grade
A         kor     1
B         usa     2
C       china     3
D       japan     4

In [35]:
# DataFrame 생성
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C","D"]
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [36]:
#(1) df.컬럼, df[컬럼]

# 하나의 컬럼 조회
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [37]:
df['country']

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [39]:
## 둘 이상의 컬럼 조회
# 멀티로 가져온다 = 리스트

print(df[['country', 'grade']]) # 대괄호 2번 감싸야 DF 형식이 된다

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [41]:
# (2) loc[인덱스명, 컬럼명]

# 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [43]:
# 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [45]:
df.loc[[0,2]] # 인덱스 값을 지정해 원하는 행의 값을 '여러 개' 가져올 수 있다

  country  rank grade
0     kor     1     A
2   china     3     C

In [46]:
df.loc[0, 'grade'] # 행과 열의 좌표. loc[행, 열] : 0번째 행에서 column값이 'grade'인 값

'A'

In [47]:
df.loc[0:2, ['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [51]:
df.loc[(df['grade'] == "A") | (df['rank'] > 2)]

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D